'''
元组
列表式方括号、元组是小括号
         元组 与 列表的区别：
定义：     ()     []
可变性：   不可变   可变
'''
a = (3, 4, "1.5")
# 元组的解包
a_0, a_1, a_2 = a
print(a_0)
print(a_1)
print(a_2)
print("--------------")

# 列表的解包
b = [3, 4, "1.5"]
b1, b2, b3 = b
print(b1)
print(b2)
print(b3)

print("--------------")

t = (1, 2, 3, 4, 5)
subset = t[1:3]  # 获取第二个到第三个元素 (2, 3)
print(subset)

print("--------------")
T = (1, 'CH', [3, 4]) #元祖的不可变性，针对复合元素是
L = T[2]
print(L)  # ==> [3, 4]
# 尝试替换L中的元素
L[1] = 40
print(L)  # ==> [3, 40]
print(T)  # ==> (1, 'CH', [3, 40])
